[
  {
    "id": "suffragists-begin-work-of-merging-with-women-voters",
    "title": "Suffragists begin work of merging with women voters",
    "author": "International News Service",
    "date": "February 14, 1920",
    "data": "CHICAGO -- Suffrage workers gathered here for the Victory convention of the National American Women Suffrage association at today's session began the work of merging its membership into the new League of Women Voters, which it was decided will supersede the association. When the thirty-sixth state ratifies the Federal suffrage amendment, the association will pass out of existence.\n\nAccording to the merger plans, auxiliaries of the association are to retrain their relationship with the board of directors to be elected at the convention but they will change their names, objects and constitutions to conform with those of the League of Women Voters. A plan for reorganization of the league was considered today.\n\nAs a beginner in scholastic instruction in the wielding of the ballot, the convention voted to establish a department and chair of politics at Bryn Mawr college. This will be a memorial to Dr. Anna Howard Shaw.",
    "image": "/assets/img/suffrage.jpg"
  },
  {
    "id": "womens-right-to-vote-now-official-in-united-states",
    "title": "Women's right to vote now official in United States",
    "author": "Unknown Author",
    "date": "August 26, 1920",
    "data": "WASHINGTON, Aug. 26, 1920 (UP) - The right of women to the ballot was formally made a part of the Constitution of the United States today when Secretary of State Colby proclaimed ratification of the nineteenth amendment.\n\nColby announced the proclamation when he arrived at his office today, having signed it shortly before at his home here.\n\nThe official certification that Tennessee had become the 36th state to ratify the amendment was taken to his home early today.\n\nA group of suffrage leaders who had waited until a late hour last night for the arrival of the Tennessee certification were hurriedly summoned to the State Department and met Colby.\n\nThey cheered when he told them the last step to make the amendment operative had been taken.\n\nAmong those in the party were Miss Alice Paul, chairman of the National Women's Party; Mrs. Abby Scott Baker; Miss Julia Emorty, Baltimore; Dr. Lydia Allen Devilbis of Georgia; Miss Mary Moore Forrest, Scituate, Mass.; Mrs. Anne Calvert Neely, Vicksburg, Miss.; Mrs. Walb, Houston, Tex.; Mrs. Cyrus Meade, Dayton, Ohio; Miss Emilie Grace Kay, St. Paul, Minn.; and Miss Emma Wold, Portland, Ore.\n\nThe Tennessee certification was taken to Colby's home by Charles L. Cooke, master of ceremonies of the State Department, and Colby and Frederick Nielson, State Department solicitor, went over it for possible legal flaws. They found none, it was stated.\n\nSuffragists had expected to make the ceremony of proclaiming the amendment a public one and evidently were disappointed.\n\nThey requested him to go through the ceremony again for their benefit and for moving picture men.\n\nColby said he would consider going over the ceremony again and went into his office.\n\nThe women, however, left the State Department without waiting for Colby's decision.\n\nThey held a jubilation at their own headquarters a short distance away.\n\nMiss Alice Paul declared that the suffragists will not relax their vigilance until they are sure that no further attempts will be made to take from the women what they have won.\n\nMiss Paul will go to New York immediately to attend a conference where the date of the National Women's Party convention will be decided.",
    "image": "/assets/img/womens-vote.jpeg"
  },
  {
    "id": "harding-elected-president-of-the-united-states",
    "title": "Harding elected president of the United States",
    "author": "United Press",
    "date": "November 03, 1920",
    "data": "NEW YORK -- The scope of the Republican victory that swept the nation continued to grow as the returns are compiled. Harding was elected by the greatest popular vote ever amassed in American history. The Republicans have a minority of 12 to 16 in the Senate and 100 in the House. Harding's electoral vote has reached 372.\n\nGov. Cox early today was credited with 149 electoral votes while 39 were counted as \"doubtful\" because of incomplete returns.\n\nHarding swept New York by a plurality estimated at 1,100,000, captured Ohio by 250,000 and ran far ahead in California, Illinois, Michigan, New Jersey, Pennsylvania and Wisconsin.\n\nCox carried the Solid South it is known with the exception of Tennessee where the returns are still incomplete. The Republicans increased the number of the Senate seats by 14 and made gains in the House.\n\nMr. and Mrs. Harding today planned to leave Marion Saturday for Point Isabel, Texas, to spend two weeks' rest at the home of Edward Scotsey, former Ohioan. Later the President-elect may take a sea trip in Central American waters, visiting the Panama Canal.\n\nHarding carried Arizona, which is normally Democratic, by a plurality of from 2,000 to 5,000.",
    "image": "/assets/img/harding-president.webp"
  },
  {
    "id": "fear-many-dead-in-japanese-fire-quake",
    "title": "Fear many dead in Japanese fire, quake",
    "author": "United Press",
    "date": "September 01, 1923",
    "data": "SAN FRANCISCO -- The Japanese city of Yokohama is on fire following a terrific earthquake crash, according to a wireless dispatch received here today by the Radio Corporation of America from the Japanese naval radio station at Iwaki.\n\nThe radiogram describing the fire was received by the Radio Corporation of America from Tomokia where the Japanese connection of the American Corporation to the station of Iwaki is located.\n\nThe message said:\n\n\"A conflagration subsequent to a severe earthquake is general throughout Yokohama. Practically the entire city is in flames, with many casualties.\"\n\nYokohama, a seaport of Japan, is the port of Tokio. It is the center of Western business and social activities in Japan. The population amounts to nearly a million. It is situated on the eastern shore of Hondo, on the Bay of Tokio, 17 miles from the imperial capital.\n\nThe Radio Corporation was advised by its station at Tomoika that land lines were completely disrupted by the earthquake. It may be some hours before news of the Yokohama disaster can be brought to the station for transmission to the United States.\n\nCommunication is being handled by train.\n\nThe Tomoika station is completely out of touch with the inland cities.\n\nThe trans-Pacific cable lines into Japan have been broken and it is necessary to transmit dispatches by way of Shanghai. It is doubtful if the cable line between Shanghai and Nagaski is in operation.\n\nOSAKA -- Practically all of Japan was shaken violently for more than an hour by an earthquake of almost unprecedented power. Severe damage was suffered in Tokio. Railway and telegraphic communications were dislocated.\n\nWASHINGTON -- There are about 200 Americana In Yokohama, swept by an earthquake and fire. State Department officials estimated today. Ordinarily there are more, sometimes as many as 1,000, but in the summer many of them go to the mountains.\n\nMost of the Americans are engaged in business in Tokyo and live in Yokohama. The department was without advices today whether any of the Americans were victims of the disaster.\n\nLONDON -- An exceptionally severe earthquake was registered by private seismographs at 4:11 this morning. The earthquake originated about 550 miles from London, it was estimated.\n\n~~\n\nWASHINGTON -- The seismograph at Georgetown University here recorded a severe earthquake of five hours' duration early today. Father Tondorf in charge of the observatory, said. He estimated the shocks occurred 5,500 miles from Washington, but could not tell the direction or probable location. The shocks began at 10:12 p.m. Friday and lasted until 3 a.m. today.\n\nCLEVELAND, Ohio -- Records of a tremendous earthquake continuing from 10:23 p.m. to 1:30 a.m. were shown today on the seismograph at St. Ignatius College it was announced by Professor F.L. Odenbach, observer.\n\nThe source of the quake could not be determined, but Odenbach said indications were it occurred some where among the islands of the Pacific along the coast of Asia.",
    "image": "/assets/img/kanto-earthquake.jpg"
  },
  {
    "id": "first-meeting-of-assembly-of-league-of-nations-is-open",
    "title": "First meeting of assembly of League of Nations is open",
    "author": "United Press",
    "date": "November 15, 1920",
    "data": "GENEVA -- The League of Nations assembled today amid the ringing of bells, the more than 100 delegates attending the sessions representing 42 states and over half the world's population. M. Paul Hymans of Belgium opened the session, reading President Wilson's convocations. Premier Motta of Switzerland welcomed the delegates. Interest centered on the credentials of Lord Robert Cecil, appointed delegate for South Africa, a question having arisen as to whether member nations can send other than citizens as delegates.\n\nM. Hymans was elected president of the League of Nations Assembly today.\n\nApplause greeted mention of the United States. \"Washington, home of liberty, and the United States cannot long remain out of the league,\" Premier Motta said.\n\nThe names of Woodrow Wilson and King Albert drew hearty applause.\n\nGeneva, capital of the world, was crowded to capacity today when representatives of nearly half a hundred nations from every corner of the globe gathered to attend the first meeting of the assembly of the League of Nations.\n\nOf the 45 powers mentioned in the covenant of the league, nearly all have already declared their allegiance to the league and are expected to avail themselves of the right to attend the first assembly meeting. Thirteen others, not named in the organic document, are applicants for admission and likely will have delegates on the ground during the meeting.\n\nThe program to be followed at the meeting will probably be (1) hearing reports of various commissions authorized by the council of the league to investigate international problems; (2) discussion and adoption of rules of procedure and examination of credentials of the delegates; (3) admission of states not mentioned in the covenant; (4) appointment and ratification of certain commissions named by the league council to carry out provisions of the peace treaty; (5) discussion of the relations between the assembly and the council; (6) report of Sir Eric Drummond on the work of the secretariat; discussion and debate on the Root-Phillmore world court, and a score of other important questions relating to questions of health, finance, alcohol, traffic in women and children and the like.\n\nOf the nations attending the Geneva assembly 18, including the five dominions of the British group, derived membership in the league automatically through the coming into effect of the Treaty of Versailles January 10, 1920. Eight other countries ratified the pact later and are classified as charter members. Thirteen nations, neutrals in the World War, were invited to become members of the league and have already accepted and been taken into the membership.\n\nChina, alone, derives her membership by being a signatory to the Treaty of St. Germain.\n\nEleven other states have applied for membership, some of them having only de facto governments. In addition, it is believed Germany, Austria, Bulgaria and Hungary will make attempts to gain admission to full fellowship among the nations as exemplified in the league now or at a later time.\n\nThe only nations that will not be represented at the first meeting of the assembly, either officially or in a semi-official way, are the United States of America, Mexico, Turkey and Russia.\n\nThe assembly was called to order at 11 o'clock by Paul Hymans of Belgium, later elected permanent chairman.\n\nA number of days will be required merely to hear the reports of the various commissions which have been authorized by the council to investigate international questions. Delegates are quartered at Geneva's main hotels, and their office work will be done in the league's new capitol, recently the National Hotel, which was acquired by Sir Eric Drummond to take care of the offices of the secretariat and commissions.\n\nAmong the reports to be heard of commissions named under provisions of the treaty are: Appointment of three members of the Saar Valley boundary commission; the Saar Valley government commission; appointment of the high commissioner of Danzig and approval of the constitution of the free city; responsibilities of the league arising out of the distribution of mandates and the enforcement of Article 22 (mandates); appointment of Dr. Fridjof Nansen, arctic explorer, to investigate repatriation of ex-enemy prisoners from Russia and Germany to their respective homes; the Polish minority treaty; the resolution regarding the admission of Switzerland; the first and second budgets of the league; relief in Central Europe and methods of combatting typhus; report on the plebiscites in Eupen and Malmedy.\n\nProbably one of the most ticklish problems the assembly will be called on to settle is likely to be proposed by Peru, Chile and Bolivia. It is the Tacno-Arica boundary controversy. Both the Peruvians and Bolivians have made known their intention of submitting the question to the league for settlement. It is expected Chile will acquiesce.\n\nSince the seventies the question of who owns the territory has worried statesmen of South America. More than once has war been threatened, and in fact Chile actually declared war on Peru and in the treaty of Ancon gained possession of the disputed province. A plebiscite was set for 1883 but for several reasons the will of the inhabitants was never allowed to be expressed. Since then a crisis has appeared on many occasions, but, although no diplomatic relations are maintained between Peru and Chile, there has been no war.\n\nOf most interest to the United States, perhaps, in view of the failure of that nation to enter the league, is the assembly's attitude toward the Root-Philmore International Court of Arbitration, proposed by a committee of world jurists under guidance of Elihu Root, former Secretary of State under President Roosevelt.\n\nInasmuch as several European nations are opposed to the unlimited powers of the court, as the United States is to the unqualified Article Ten of the covenant, considerable debate is expected before the court's constitution is finally approved.\n\nThat the court will certainly be established is assured by action of the League council in approving of the plan for formulation of a permanent court of international justice. Mainly the mooted questions are what form it will take and to what extent nations will adhere to its decisions.\n\nFollowing are facts about the meeting:\n\nPlace -- Geneva, Switzerland, seat of the League.\n\nTime -- November 15.\n\nNumber of nations to be represented -- 55.\n\nNumber of delegates -- Not more than 3 for each member-state, or not more than 165 for all.\n\nNumber of delegates with power to vote -- 55.\n\nIn general, decisions of the assembly must be by unanimous vote, but certain important matters may be decided by a mere majority or by two-thirds majority.\n\nPresiding officer -- M. Paul Hymans of Belgium, or Señor Quinones de Leon of Spain.\n\nSecretary-General -- Sir Eric Drummond of England.",
    "image": "/assets/img/league-of-nations.jpg"
  }
]
